{"modelTopology": {"keras_version": "2.2.2", "model_config": {"config": [{"config": {"activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "padding": "valid", "dtype": "float32", "kernel_size": [5, 5], "bias_constraint": null, "filters": 10, "name": "conv2d_3", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "padding": "valid", "kernel_size": [5, 5], "filters": 20, "name": "conv2d_4", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"rate": 0.5, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "use_bias": true, "trainable": true, "kernel_constraint": null, "name": "dense_3", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 50, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "use_bias": true, "trainable": true, "kernel_constraint": null, "name": "dense_4", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_2", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}, "backend": "tensorflow", "training_config": {"optimizer_config": {"config": {"amsgrad": false, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "decay": 0.0, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513}, "class_name": "Adam"}, "loss": "sparse_categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [5, 5, 1, 10], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [10], "name": "conv2d_3/bias"}, {"dtype": "float32", "shape": [5, 5, 10, 20], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [20], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [320, 50], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [50], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [50, 2], "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [2], "name": "dense_4/bias"}]}]}